# -*- coding: utf-8 -*-
"""
Created on Tue Mar  3 18:24:27 2020
@author: Justin
"""
'''
定义人物词频的列表
用pyecharts画出词云，用最基础的默认格式
'''

from pyecharts.charts import WordCloud

# 上面的写法可以解读为：从 大工具包pyecharts中 的 小工具包charts中 加载 WordCloud

# 用于生成词云的列表，列表元素为元组，元组有固定格式要求
# 元组的第一个元素是“词”
# 元组的第二个元素是“词频”，是字符串形式的数值
wordfreq_list = [('诸葛亮', '1068'), ('刘备', '1025'), ('曹操', '953'),
                 ('关羽', '638'), ('张飞', '365'), ('赵云', '333'),
                 ('吕布', '302'), ('孙权', '273'), ('周瑜', '265'),
                 ('司马懿', '241'), ('魏延', '212'), ('袁绍', '199'),
                 ('马超', '194'), ('姜维', '179'), ('黄忠', '168'),
                 ('马岱', '127'), ('庞德', '122'), ('刘表', '119'),
                 ('张辽', '119'), ('董卓', '114'), ('徐晃', '113'),
                 ('孙策', '108'), ('鲁肃', '107'), ('邓艾', '106'),
                 ('许褚', '92'), ('司马昭', '89'), ('夏侯渊', '88'),
                 ('王平', '88'), ('曹仁', '86'), ('刘璋', '83'),
                 ('吕蒙', '83'), ('张苞', '81'), ('袁术', '78'),
                 ('孟获', '78'), ('曹洪', '77'), ('陆逊', '74'),
                 ('孟达', '73')]

# #-------生成词云---------------------------------
cloud = WordCloud()  # 初始化词云对象

# 向词云中添加内容，第一个参数可以设为空，第二个参数为元组列表（词和词频）
cloud.add('', wordfreq_list)

# 生成词云图文件
# render会生成HTML文件。默认是当前目录render.html，也可以指定文件名参数
cloud.render()
